jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_master/src/fsl_dspi_master_driver.c
    /* start the transfer process*/
    if (dspiState->useDma)
    {
        if (DSPI_DRV_MasterStartTransferDma(instance, device) == kStatus_DSPI_Busy)
        {
            return kStatus_DSPI_Busy;
        }
    }
    else
    {
        if (DSPI_DRV_MasterStartTransfer(instance, device) == kStatus_DSPI_Busy)
        {
            return kStatus_DSPI_Busy;
        }
    }

    /* As this is a synchronous transfer, wait until the transfer is complete.*/
    dspi_status_t error = kStatus_DSPI_Success;
    osa_status_t syncStatus;

    do
    {
        syncStatus = OSA_SemaWait(&dspiState->irqSync, timeout);
    }while(syncStatus == kStatus_OSA_Idle);

    if (syncStatus != kStatus_OSA_Success)
    {
        /* Abort the transfer so it doesn't continue unexpectedly.*/
        DSPI_DRV_MasterAbortTransfer(instance);

        error = kStatus_DSPI_Timeout;
    }

    return error;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_MasterTransferData
 * Description   : Perform a non-blocking SPI master mode transfer.
 * This function will return immediately. It is the user's responsiblity to check back to
 * ascertain if the transfer is complete (using the DSPI_DRV_MasterGetTransferStatus function). This
 * function simultaneously sends and receives data on the SPI bus, as SPI is naturally
 * a full-duplex bus.
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_MasterTransferData(uint32_t instance,
                                          const dspi_device_t * restrict device,
                                          const uint8_t * sendBuffer,
                                          uint8_t * receiveBuffer,
                                          size_t transferByteCount)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    dspi_master_state_t * dspiState = (dspi_master_state_t *)g_dspiStatePtr[instance];

    /* fill in members of the run-time state struct*/
    dspiState->isTransferAsync = true;
    dspiState->sendBuffer = sendBuffer;
    dspiState->receiveBuffer = (uint8_t *)receiveBuffer;
    dspiState->remainingSendByteCount = transferByteCount;
    dspiState->remainingReceiveByteCount = transferByteCount;

    /* start the transfer process*/
    if (dspiState->useDma)
    {
        if (DSPI_DRV_MasterStartTransferDma(instance, device) == kStatus_DSPI_Busy)
        {
            return kStatus_DSPI_Busy;
        }
    }
    else
    {
        if (DSPI_DRV_MasterStartTransfer(instance, device) == kStatus_DSPI_Busy)
        {
            return kStatus_DSPI_Busy;
        }
    }

    /* Else, return immediately as this is an async transfer */
    return kStatus_DSPI_Success;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_MasterGetTransferStatus
 * Description   : Returns whether the previous transfer has finished yet.
 * When performing an async transfer, the user can call this function to ascertain the state of the
 * current transfer: in progress (or busy) or complete (success). In addition, if the transfer
 * is still in progress, the user can obtain the number of words that have been currently
 * transferred.
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_MasterGetTransferStatus(uint32_t instance, uint32_t * framesTransferred)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    dspi_master_state_t * dspiState = (dspi_master_state_t *)g_dspiStatePtr[instance];
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    /* Fill in the bytes transferred.*/
    if (framesTransferred)
    {
        *framesTransferred = DSPI_HAL_GetTransferCount(baseAddr);
    }

    return (dspiState->isTransferInProgress ? kStatus_DSPI_Busy : kStatus_DSPI_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_MasterAbortTransfer
 * Description   : Terminates an asynchronous transfer early.
 * During an async transfer, the user has the option to terminate the transfer early if the transfer
 * is still in progress.
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_MasterAbortTransfer(uint32_t instance)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    dspi_master_state_t * dspiState = (dspi_master_state_t *)g_dspiStatePtr[instance];

    /* Check if a transfer is running.*/
    if (!dspiState->isTransferInProgress)
    {
        return kStatus_DSPI_NoTransferInProgress;
    }

    /* Stop the running transfer.*/
    DSPI_DRV_MasterCompleteTransfer(instance);

    return kStatus_DSPI_Success;
}

/*!
 * @brief Initiate (start) a transfer. This is not a public API as it is called from other
 *  driver functions
 */
static dspi_status_t DSPI_DRV_MasterStartTransfer(uint32_t instance,
                                                  const dspi_device_t * restrict device)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    dspi_master_state_t * dspiState = (dspi_master_state_t *)g_dspiStatePtr[instance];
    uint32_t baseAddr = g_dspiBaseAddr[instance];
    uint32_t calculatedBaudRate;

    /* Check the transfer byte count. If bits/frame > 8, meaning 2 bytes, then
     * the transfer byte count must not be an odd count, if so, drop the last odd byte.
     * Perform this operation here to ensure we get the latest bits/frame setting.
     */
    if (dspiState->bitsPerFrame > 8)
    {
        dspiState->remainingSendByteCount &= ~1UL;
        dspiState->remainingReceiveByteCount &= ~1UL;
    }

    /* If the transfer count is zero, then return immediately.*/
    if (dspiState->remainingSendByteCount == 0)
    {
        /* Signal the synchronous completion object if the transfer wasn't async.
         * Otherwise, when we return the the sync function we'll get stuck in the sync wait loop.
         */
        if (!dspiState->isTransferAsync)
        {
            OSA_SemaPost(&dspiState->irqSync);
        }

