jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_master/src/fsl_dspi_master_driver.c
        return kStatus_DSPI_Success;
    }

    /* Check that we're not busy.*/
    if (dspiState->isTransferInProgress)
    {
        return kStatus_DSPI_Busy;
    }

    /* Configure bus for this device. If NULL is passed, we assume the caller has
     * preconfigured the bus using DSPI_DRV_MasterConfigureBus().
     * Do nothing for calculatedBaudRate. If the user wants to know the calculatedBaudRate
     * then they can call this function separately.
     */
    if (device)
    {
        DSPI_DRV_MasterConfigureBus(instance, device, &calculatedBaudRate);
        dspiState->bitsPerFrame = device->dataBusConfig.bitsPerFrame;/*update dspiState bits/frame*/
    }

    /* Save information about the transfer for use by the ISR.*/
    dspiState->isTransferInProgress = true;

    /* Enable the DSPI module for the duration of this transfer.*/
    DSPI_HAL_Enable(baseAddr);

    /* flush the fifos*/
    DSPI_HAL_SetFlushFifoCmd(baseAddr, true, true);

    /* Fill of the TX FIFO with initial data */
    DSPI_DRV_MasterFillupTxFifo(instance, true);

    /* RX FIFO Drain request: RFDF_RE to enable RFDF interrupt
     * Since SPI is a synchronous interface, we only need to enable the RX interrupt.
     * The IRQ handler will get the status of RX and TX interrupt flags.
     */
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateIntReq, true);

    return kStatus_DSPI_Success;
}

/*!
 * @brief Fill up the TX FIFO with data.
 * This function fills up the TX FIFO with initial data for start of transfers where it will
 * first clear the transfer count.  Otherwise, if the TX FIFO fill is part of an ongoing transfer
 * then do not clear the transfer count.  The param "isInitialData" is used to determine if this
 * is an initial data fill.
 * This is not a public API as it is called from other driver functions.
 */
void DSPI_DRV_MasterFillupTxFifo(uint32_t instance, bool isInitialData)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    dspi_master_state_t * dspiState = (dspi_master_state_t *)g_dspiStatePtr[instance];
    uint32_t baseAddr = g_dspiBaseAddr[instance];
    dspi_command_config_t command;  /* create an instance of the data command struct*/
    uint16_t wordToSend = 0;
    uint32_t firstWordFlag;
    /* Declare variables for storing volatile data later in the code */
    uint32_t remainingReceiveByteCount, remainingSendByteCount;

    /* Before sending the data, we first need to initialize the data command struct
     * Configure the data command attributes for the desired PCS, CTAR, and continuous PCS
     * which are derived from the run-time state struct
     */
    command.whichPcs = dspiState->whichPcs;
    command.whichCtar = dspiState->whichCtar;
    command.isChipSelectContinuous = dspiState->isChipSelectContinuous;
    command.isEndOfQueue = 0;

    /* If the data is the first word to be sent, then enable "clear the transfer count"
     * and set the firstWord flag. After the first word is sent, clear both of these.
     * Also, clear the end of queue member and set when it is determined that the last data
     * word is to be sent
     */
    if (isInitialData)
    {
        command.clearTransferCount = 1;
        firstWordFlag = 1;
    }
    /* Otherwise, if filling the TX FIFO is part of an ongoing transfer (like being called from
     * the ISR), then clear these.
     */
    else
    {
        command.clearTransferCount = 0;
        firstWordFlag = 0;
    }

    /* Architectural note: When developing the TX FIFO fill functionality, it was found that to
     * achieve more efficient run-time performance, it was better to first check the bits/frame
     * setting and then proceed with the FIFO fill management process, rather than to clutter the
     * FIFO fill process with continual checks of the bits/frame setting.
     */

    /* If bits/frame is greater than one byte */
    if (dspiState->bitsPerFrame > 8)
    {
        /* Fill the fifo until it is full or until the send word count is 0 or until the difference
         * between the remainingReceiveByteCount and remainingSendByteCount equals the FIFO depth.
         * The reason for checking the difference is to ensure we only send as much as the
         * RX FIFO can receive.
         * For this case wher bitsPerFrame > 8, each entry in the FIFO contains 2 bytes of the
         * send data, hence the difference between the remainingReceiveByteCount and
         * remainingSendByteCount must be divided by 2 to convert this difference into a
         * 16-bit (2 byte) value.
         */
        /* Store the DSPI state struct volatile member variables into temporary
         * non-volatile variables to allow for MISRA compliant calculations
         */
        remainingReceiveByteCount = dspiState->remainingReceiveByteCount;
        remainingSendByteCount = dspiState->remainingSendByteCount;

        while((DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxFifoFillRequest) == 1) &&
              ((remainingReceiveByteCount - remainingSendByteCount)/2 <
                FSL_FEATURE_DSPI_FIFO_SIZEn(instance)))
        {
            /* On the last word to be sent, set the end of queue flag in the data command struct
             * and ensure that the CONT bit in the PUSHR is also cleared even if it was cleared to
             * begin with. If CONT is set it means continuous chip select operation and to ensure
             * the chip select is de-asserted, this bit must be cleared on the last data word.
             */
            if ((dspiState->remainingSendByteCount - 2) == 0)
            {
                command.isEndOfQueue = 1;
                command.isChipSelectContinuous = 0;
            }

            /* If this is the first word to be transmitted, clear firstWord flag after transmit */
            if (firstWordFlag == 1)
            {
                /* If a send buffer was provided, the word comes from there. Otherwise we just send
                 * a zero (initialized above).
                 */
                if (dspiState->sendBuffer)
                {
                    wordToSend = *(dspiState->sendBuffer);
                    ++dspiState->sendBuffer; /* increment to next data byte */
                    wordToSend |= (unsigned)(*(dspiState->sendBuffer)) << 8U;
                    ++dspiState->sendBuffer; /* increment to next data byte */
                }

                DSPI_HAL_WriteDataMastermode(baseAddr, &command, wordToSend);
                dspiState->remainingSendByteCount -= 2; /* decrement remainingSendByteCount by 2 */

                firstWordFlag = 0; /* clear firstWordFlag */
                command.clearTransferCount = 0; /* Disable clear transfer count for remaining data*/
            }
            else
            {
                /* If a send buffer was provided, the word comes from there. Otherwise we just send
                 * a zero (initialized above).
                 */
                if (dspiState->sendBuffer)
                {
                    wordToSend = *(dspiState->sendBuffer);
                    ++dspiState->sendBuffer; /* increment to next data byte */
                    wordToSend |= (unsigned)(*(dspiState->sendBuffer)) << 8U;
                    ++dspiState->sendBuffer; /* increment to next data byte */
                }
                DSPI_HAL_WriteDataMastermode(baseAddr, &command, wordToSend);
                dspiState->remainingSendByteCount -= 2; /* decrement remainingSendByteCount by 2 */
            }

            /* try to clear TFFF by writing a one to it; it will not clear if TX FIFO not full*/
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);

            /* Store the DSPI state struct volatile member variables into temporary
             * non-volatile variables to allow for MISRA compliant calculations
             */
            remainingReceiveByteCount = dspiState->remainingReceiveByteCount;
            remainingSendByteCount = dspiState->remainingSendByteCount;

