jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_master/src/fsl_dspi_master_driver.c
            /* exit loop if send count is zero */
            if (dspiState->remainingSendByteCount == 0)
            {
                break;
            }
        } /* End of TX FIFO fill while loop */
    }
    /* Optimized for bits/frame less than or equal to one byte. */
    else
    {
        /* Fill the fifo until it is full or until the send word count is 0 or until the difference
         * between the remainingReceiveByteCount and remainingSendByteCount equals the FIFO depth.
         * The reason for checking the difference is to ensure we only send as much as the
         * RX FIFO can receive.
         */
        /* Store the DSPI state struct volatile member variables into temporary
         * non-volatile variables to allow for MISRA compliant calculations
         */
        remainingReceiveByteCount = dspiState->remainingReceiveByteCount;
        remainingSendByteCount = dspiState->remainingSendByteCount;

        while((DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxFifoFillRequest) == 1) &&
              ((remainingReceiveByteCount - remainingSendByteCount) <
                FSL_FEATURE_DSPI_FIFO_SIZEn(instance)))
        {
            /* On the last word to be sent, set the end of queue flag in the data command struct
             * and ensure that the CONT bit in the PUSHR is also cleared even if it was cleared to
             * begin with. If CONT is set it means continuous chip select operation and to ensure
             * the chip select is de-asserted, this bit must be cleared on the last data word.
             */
            if ((dspiState->remainingSendByteCount - 1) == 0)
            {
                command.isEndOfQueue = 1;
                command.isChipSelectContinuous = 0;
            }

            /* If this is the first word to be transmitted, clear firstWord flag after transmit*/
            if (firstWordFlag == 1)
            {
                /* If a send buffer was provided, the word comes from there. Otherwise we just send
                 * a zero (initialized above).
                 */
                if (dspiState->sendBuffer)
                {
                    wordToSend = *(dspiState->sendBuffer);
                    ++dspiState->sendBuffer; /* increment to next data byte */
                }
                DSPI_HAL_WriteDataMastermode(baseAddr, &command, wordToSend);
                --dspiState->remainingSendByteCount; /* decrement remainingSendByteCount */

                firstWordFlag = 0; /* clear firstWordFlag */
                command.clearTransferCount = 0; /* Disable clear transfer count for remaining data*/
            }
            else
            {
                /* If a send buffer was provided, the word comes from there. Otherwise we just send
                 * a zero (initialized above).
                 */
                if (dspiState->sendBuffer)
                {
                    wordToSend = *(dspiState->sendBuffer);
                    ++dspiState->sendBuffer; /* increment to next data word*/
                }
                DSPI_HAL_WriteDataMastermode(baseAddr, &command, wordToSend);
                --dspiState->remainingSendByteCount; /* decrement remainingSendByteCount*/
            }

            /* try to clear TFFF by writing a one to it; it will not clear if TX FIFO not full*/
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);

            /* Store the DSPI state struct volatile member variables into temporary
             * non-volatile variables to allow for MISRA compliant calculations
             */
            remainingReceiveByteCount = dspiState->remainingReceiveByteCount;
            remainingSendByteCount = dspiState->remainingSendByteCount;

            /* exit loop if send count is zero */
            if (dspiState->remainingSendByteCount == 0)
            {
                break;
            }
        } /* End of TX FIFO fill while loop */
    }
}

/*!
 * @brief Finish up a transfer.
 * Cleans up after a transfer is complete. Interrupts are disabled, and the DSPI module
 * is disabled. This is not a public API as it is called from other driver functions.
 */
static void DSPI_DRV_MasterCompleteTransfer(uint32_t instance)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    dspi_master_state_t * dspiState = (dspi_master_state_t *)g_dspiStatePtr[instance];
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    /* The transfer is complete.*/
    dspiState->isTransferInProgress = false;

    /* Disable interrupt requests*/
    /* RX FIFO Drain request: RFDF_RE */
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateIntReq, false);

    /* Disable TX FIFO Fill request that may be enabled by the DMA operation, which is ok to
     * disable even if DMA is not enabled since this should be disabled anyway
     */
    DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateIntReq, false);

    /* Disable End of Queue request */
    DSPI_HAL_SetIntMode(baseAddr, kDspiEndOfQueue, false);

    /* Signal the synchronous completion object regardless if the transfer was blocking or not.
     * There is no harm in calling this for async functions and the blocking function will
     * re-initialize the sync object
     */
    OSA_SemaPost(&dspiState->irqSync);

    /* Transfer is complete, so disable the module. It gets re-enabled during the
     * start transfer function
     */
    DSPI_HAL_Disable(baseAddr);
}

/*!
 * @brief Interrupt handler for DSPI master mode.
 * This handler uses the buffers stored in the dspi_master_state_t structs to transfer data.
 * This is not a public API as it is called whenever an interrupt occurs.
 */
void DSPI_DRV_MasterIRQHandler(uint32_t instance)
{
    /* instantiate local variable of type dspi_master_state_t and point to global state */
    dspi_master_state_t * dspiState = (dspi_master_state_t *)g_dspiStatePtr[instance];

    uint32_t baseAddr = g_dspiBaseAddr[instance];

    /* For interrupt driver operation (non-DMA operation) */
    if (!(dspiState->useDma))
    {
        /* Check read buffer.*/
        uint16_t wordReceived; /* Maximum supported data bit length in master mode is 16-bits */

        /* If bits/frame is greater than one byte */
        if (dspiState->bitsPerFrame > 8)
        {
            while (DSPI_HAL_GetStatusFlag(baseAddr, kDspiRxFifoDrainRequest))
            {
                wordReceived = DSPI_HAL_ReadData(baseAddr);
                /* clear the rx fifo drain request, needed for non-DMA applications as this flag
                 * will remain set even if the rx fifo is empty. By manually clearing this flag, it
                 * either remain clear if no more data is in the fifo, or it will set if there is
                 * more data in the fifo.
                 */
                DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoDrainRequest);

