jamesmunns/kinetis-rs/platform/drivers/dspi/dspi_master/src/fsl_dspi_master_driver.c
                if (dspiState->receiveBuffer)
                {
                    *dspiState->receiveBuffer = wordReceived; /* Write first data byte */
                    ++dspiState->receiveBuffer; /* increment to next data byte */
                    *dspiState->receiveBuffer = wordReceived >> 8; /* Write second data byte */
                    ++dspiState->receiveBuffer; /* increment to next data byte */
                }
                dspiState->remainingReceiveByteCount -= 2;

                if (dspiState->remainingReceiveByteCount == 0)
                {
                    break;
                }
            } /* End of RX FIFO drain while loop */
        }
        /* Optimized for bits/frame less than or equal to one byte. */
        else
        {
            while (DSPI_HAL_GetStatusFlag(baseAddr, kDspiRxFifoDrainRequest))
            {
                wordReceived = DSPI_HAL_ReadData(baseAddr);
                /* clear the rx fifo drain request, needed for non-DMA applications as this flag
                 * will remain set even if the rx fifo is empty. By manually clearing this flag, it
                 * either remain clear if no more data is in the fifo, or it will set if there is
                 * more data in the fifo.
                 */
                DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoDrainRequest);

                if (dspiState->receiveBuffer)
                {
                    *dspiState->receiveBuffer = wordReceived;
                    ++dspiState->receiveBuffer;
                }
                --dspiState->remainingReceiveByteCount;

                if (dspiState->remainingReceiveByteCount == 0)
                {
                    break;
                }
            } /* End of RX FIFO drain while loop */
        }

        /* Check write buffer. We always have to send a word in order to keep the transfer
         * moving. So if the caller didn't provide a send buffer, we just send a zero.
         */
        if (dspiState->remainingSendByteCount)
        {
            /* Fill of the TX FIFO with ongoing data */
            DSPI_DRV_MasterFillupTxFifo(instance, false);
        }

        /* Check if we're done with this transfer.*/
        if ((dspiState->remainingSendByteCount == 0) && (dspiState->remainingReceiveByteCount == 0))
        {
            /* Complete the transfer. This disables the interrupts, so we don't wind up in
             * the ISR again.
             */
            DSPI_DRV_MasterCompleteTransfer(instance);
        }
    }
    else /* For DMA based operations */
    {
        /* If the interrupt is due to an end-of-queue, then complete. This interrupt is
         * is used during DMA operations and we want to handle this interrupt only
         * when DMA is being used.  For interrupt-driven transfer, we complete the transfer only
         * when remaining send and receive byte counts are zero.
         */
        if (DSPI_HAL_GetStatusFlag(baseAddr, kDspiEndOfQueue))
        {
            /* Complete the transfer. This disables the interrupts, so we don't wind up in
             * the ISR again.
             */
            DSPI_DRV_MasterCompleteTransfer(instance);
        }
    }
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

